/*
3.Порахувати, скільки разів зустрічається певна цифра у введеній послідовності чисел.
Кількість чисел, що вводяться і цифра, яку необхідно порахувати, задаються введенням з клавіатури.
*/

# include <iostream>

using namespace std;

int main() {
    setlocale(LC_ALL, "Russian");
    int n, d, m, t, i;
    cout << "Количество чисел: ";
    cin >> n;
    cout << "Цифра: ";
    cin >> d;
    t = 0;
    for (i = 0; i < n; i++) {
        cin >> m;
        while (m > 0) {
            if (m % 10 == d) {
                t += 1;
            }
            m = m / 10;
        }
    }
    cout << "Количество цифр: " << t << "\n";
    return 0;
}