//2.Дано цілі числа a , b , c , що є сторонами деякого трикутника. 
//Перевірити істинність висловлювання: «Трикутник зі сторонами a , b , c є рівнобедреним».   

#include <math.h>
#include <iostream>
using namespace std;
void main()
{
	setlocale(LC_ALL, "Russian");
	int a, b, c;
	cout << "Введите первую сторону треугольника: ";
	cin >> a;
	cout << "Введите вторую сторону треугольника: ";
	cin >> b;
	cout << "Введите третью сторону треугольника: ";
	cin >> c;
	if ((a == b) || (a == c) || (b == c)) {
		cout << "Треугольльник являеться равнобедренным" << endl;
	}
	else {
		cout << "Треугольник не равнобедренный" << endl;
	}
	cin.get();
	cin.get();
}


